Quanghoster/ESP8266HueEmulator/ESP8266HueEmulator/LightService.cpp
static const char* _ssdp_xml_template = "<?xml version=\"1.0\" ?>"
  "<root xmlns=\"urn:schemas-upnp-org:device-1-0\">"
  "<specVersion><major>1</major><minor>0</minor></specVersion>"
  "<URLBase>http://{ip}:80/</URLBase>"
  "<device>"
    "<deviceType>urn:schemas-upnp-org:device:Basic:1</deviceType>"
    "<friendlyName>Philips hue ({ip})</friendlyName>"
    "<manufacturer>Royal Philips Electronics</manufacturer>"
    "<manufacturerURL>http://www.philips.com</manufacturerURL>"
    "<modelDescription>Philips hue Personal Wireless Lighting</modelDescription>"
    "<modelName>Philips hue bridge 2012</modelName>"
    "<modelNumber>929000226503</modelNumber>"
    "<modelURL>http://www.meethue.com</modelURL>"
    "<serialNumber>{mac}</serialNumber>"
    "<UDN>uuid:2f402f80-da50-11e1-9b23-{mac}</UDN>"
    "<presentationURL>index.html</presentationURL>"
    "<iconList>"
    "  <icon>"
    "    <mimetype>image/png</mimetype>"
    "    <height>48</height>"
    "    <width>48</width>"
    "    <depth>24</depth>"
    "    <url>hue_logo_0.png</url>"
    "  </icon>"
    "  <icon>"
    "    <mimetype>image/png</mimetype>"
    "    <height>120</height>"
    "    <width>120</width>"
    "    <depth>24</depth>"
    "    <url>hue_logo_3.png</url>"
    "  </icon>"
    "</iconList>"
  "</device>"
  "</root>";

int ssdpMsgFormatCallback(SSDPClass *ssdp, char *buffer, int buff_len,
                          bool isNotify, int interval, char *modelName,
                          char *modelNumber, char *uuid, char *deviceType,
                          uint32_t ip, uint16_t port, char *schemaURL) {
  if (isNotify) {
    return snprintf(buffer, buff_len,
      _ssdp_notify_template,
      interval,
      ipString.c_str(), port, schemaURL,
      modelName, modelNumber,
      bridgeIDString.c_str(),
      deviceType,
      uuid);
  } else {
    return snprintf(buffer, buff_len,
      _ssdp_response_template,
      interval,
      ipString.c_str(), port, schemaURL,
      modelName, modelNumber,
      bridgeIDString.c_str(),
      deviceType,
      uuid);
  }
}

class LightGroup {
  public:
    LightGroup(aJsonObject *root) {
      aJsonObject* jName = aJson.getObjectItem(root, "name");
      aJsonObject* jLights = aJson.getObjectItem(root, "lights");
      // jName and jLights guaranteed to exist
      name = jName->valuestring;
      for (int i = 0; i < aJson.getArraySize(jLights); i++) {
        aJsonObject* jLight = aJson.getArrayItem(jLights, i);
        // lights are 1-based and map to the 0-based bitfield
        int lightNum = atoi(jLight->valuestring);
        if (lightNum != 0) {
          lights |= (1 << (lightNum - 1));
        }
      }
    }
    aJsonObject *getJson() {
      aJsonObject *object = aJson.createObject();
      aJson.addStringToObject(object, "name", name.c_str());
      aJsonObject *lightsArray = aJson.createArray();
      aJsonObject *lightsState = aJson.createObject();
      aJson.addStringToObject(lightsState, "all_on", "true");
      aJson.addStringToObject(lightsState, "any_on", "true");
      aJson.addItemToObject(object, "state", lightsState);
      
      aJson.addItemToObject(object, "lights", lightsArray);
      for (int i = 0; i < 16; i++) {
        if (!((1 << i) & lights)) {
          continue;
        }
        // add light to list
        String lightNum = "";
        lightNum += (i + 1);
        aJson.addItemToArray(lightsArray, aJson.createItem(lightNum.c_str()));
      }
      aJson.addStringToObject(object, "type", "LightGroup");   
      return object;
    }


    aJsonObject *getSceneJson(bool withStates) {
      aJsonObject *object = aJson.createObject();
      aJson.addStringToObject(object, "name", name.c_str());
      //aJson.addStringToObject(object, "id", id.c_str());
      aJsonObject *lightsArray = aJson.createArray();
      aJson.addItemToObject(object, "lights", lightsArray);
      for (int i = 0; i < 16; i++) {
        if (!((1 << i) & lights)) {
          continue;
        }
        // add light to list
        String lightNum = "";
        lightNum += (i + 1);
        aJson.addItemToArray(lightsArray, aJson.createItem(lightNum.c_str()));
      }
            
      aJson.addStringToObject(object, "owner", "api");
      aJson.addBooleanToObject(object, "recycle", false);
      aJson.addBooleanToObject(object, "locked", false);
      aJsonObject *appData = aJson.createObject();
      aJson.addNumberToObject(appData, "version", 1);
      aJson.addStringToObject(appData, "data", "kbixx_r01_d15");
      aJson.addItemToObject(object, "appdata", appData);      
      aJson.addStringToObject(object, "picture", "");
      aJson.addStringToObject(object, "lastupdated", "2017-11-04T10:17:15");
      aJson.addNumberToObject(object, "version", 2);
      aJson.addBooleanToObject(object, "active", true);
      if(withStates==true)
      {
        Serial.println("Adding lightstates");
        aJsonObject *lightStates = aJson.createArray();  
        for (int i = 0; i < 16; i++) {
          if (!((1 << i) & lights)) {
            continue;
          }       
          Serial.print("Adding light ");Serial.println(i); 
          // add light to list
          String lightNum = "";
          lightNum += (i + 1);
          LightHandler *handler = LightService.getLightHandler(i);
          if(handler == NULL){
            Serial.println("Handler not found");
            continue;
          }
          HueLightInfo currentInfo = handler->getInfo(i);
          
          aJsonObject *lightState = aJson.createObject();
          
          aJsonObject *lightStateData = aJson.createObject();
          
          Serial.println("on/bri");
          aJson.addBooleanToObject(lightStateData, "on", currentInfo.on);
                 
          aJson.addNumberToObject(lightStateData, "bri", currentInfo.brightness);
          aJson.addNumberToObject(lightStateData, "sat", currentInfo.saturation);
         
          double numbers[2] = {0.0, 0.0};
          aJsonObject *xy = aJson.createFloatArray(numbers, 2);     
          Serial.println("Adding xy");
          aJson.addItemToObject(lightStateData,"xy",xy);  
          
          Serial.println("add states");
          aJson.addItemToObject(lightState, lightNum.c_str(), lightStateData);
          
          aJson.addItemToArray(lightStates, lightState);
        
