Quanghoster/ESP8266HueEmulator/ESP8266HueEmulator/LightService.cpp
        }        
        aJson.addItemToObject(object,"lightstates",lightStates);
      }

      Serial.println("returning scenes");
      return object;
    }
    unsigned int getLightMask() {
      return lights;
    }
    // only used for scenes
    String id;
    String getName()
    {
      return name;  
    }
  private:
    String name;
    // use unsigned int to hold members of this group. 2 bytes -> supports up to 16 lights
    unsigned int lights = 0;
    // no need to hold the group type, only LightGroup is supported for API 1.4
};

void on(HandlerFunction fn, const String &wcUri, HTTPMethod method, char wildcard = '*') {
  HTTP->addHandler(new WcFnRequestHandler(fn, wcUri, method, wildcard));
}
 
String listFiles(String _template)
{
  String filePrefix = _template;
  filePrefix.replace("%d","");
  Serial.println(filePrefix);
  String response = "";
  
  Dir dir = SPIFFS.openDir("/");
  while (dir.next()) {    
    if(dir.fileName().startsWith(filePrefix))
    {
      Serial.println(dir.fileName()); 
      response += "<li>" + dir.fileName() + "</li>";
    }
 }   
 return response;
}

void indexPageFn() {
  String response = "<html><body>"
  "<h2>Philips HUE ( {ip} )</h2>"
  "<h3>FreeMemory:{mem}</h3>"
  "<p>Available lights:</p>"
  "<ul>{lights}</ul>"
  "<ul>File Cache</ul>"
  "<ul>Groups:</ul>"
  "<ul>{group-files}</ul>"
  "<ul>Scenes:</ul>"
  "<ul>{scene-files}</ul>"
  "<a href='/cache/clear'>Clear Cached Groups and Scenes</a>"
  "</body></html>";
  
  String lights = "";
  
   for (int i = 0; i < LightService.getLightsAvailable(); i++) {
    if (!lightHandlers[i]) {
      continue;
    }
        
    lights += "<li>" + lightHandlers[i]->getFriendlyName(i) + "</li>";
  }
  String sceneFiles = listFiles(SCENE_FILE_TEMPLATE);
  String groupFiles = listFiles(GROUP_FILE_TEMPLATE);
  String freeHeap = String(ESP.getFreeHeap(),DEC);
  response.replace("{mem}", freeHeap);
  response.replace("{ip}", ipString);
  response.replace("{lights}", lights);
  response.replace("{group-files}", groupFiles);  
  response.replace("{scene-files}", sceneFiles);  
  HTTP->send(200, "text/html", response);
}

void clearFiles(String _template)
{
  String filePrefix = _template;
  filePrefix.replace("%d","");
  Serial.println(filePrefix);
  String response = "";
  
  Dir dir = SPIFFS.openDir("/");
  while (dir.next()) {    
    if(dir.fileName().startsWith(filePrefix))
    {
      Serial.print("deleting ");Serial.println(dir.fileName());
      SPIFFS.remove(dir.fileName());
    }
 }   
}

// remove the group and scene cache files
void cacheClearFn()
{
  clearFiles(GROUP_FILE_TEMPLATE);
  clearFiles(SCENE_FILE_TEMPLATE);
  indexPageFn();
}

void descriptionFn() {
  String response = _ssdp_xml_template;

  String escapedMac = macString;
  escapedMac.replace(":", "");
  escapedMac.toLowerCase();
  
  response.replace("{mac}", escapedMac);
  response.replace("{ip}", ipString);

  HTTP->send(200, "text/xml", response);
  Serial.println(response);
}

void unimpFn(WcFnRequestHandler *handler, String requestUri, HTTPMethod method) {
  String str = "{}";
  HTTP->send(200, "text/plain", str);
  Serial.println(str);
}

aJsonObject *wrapWithSuccess(aJsonObject *body) {
  aJsonObject *success = aJson.createObject();
  aJson.addItemToObject(success, "success", body);
  return success;
}

// targetBase is assumed to have a trailing slash (/)
aJsonObject *generateTargetPutResponse(aJsonObject *body, String targetBase) {
  aJsonObject *root = aJson.createArray();
  for (int i = 0; i < aJson.getArraySize(body); i++) {
    aJsonObject *success = aJson.createObject();
    aJson.addItemToArray(root, wrapWithSuccess(success));
    aJsonObject *entry = aJson.getArrayItem(body, i);
    String target = targetBase + entry->name;
    switch (entry->type) {
      case aJson_Boolean:
        aJson.addBooleanToObject(success, target.c_str(), entry->valuebool);
        break;
      case aJson_Int:
        aJson.addNumberToObject(success, target.c_str(), entry->valueint);
        break;
      case aJson_String:
        aJson.addStringToObject(success, target.c_str(), entry->valuestring);
        break;
      case aJson_Float:
        aJson.addNumberToObject(success, target.c_str(), entry->valuefloat);
        break;
      case aJson_Array: {
        aJsonObject *xy = aJson.createArray();
        aJson.addItemToObject(success, target.c_str(), xy);
        for (int j = 0; j < aJson.getArraySize(entry); j++) {
          aJson.addItemToArray(xy, aJson.createItem(aJson.getArrayItem(entry, j)->valuefloat));
        }
        break;
      }
      default:
        break;
    }
  }
  return root;
}

void addConfigJson(aJsonObject *config);
void sendJson(aJsonObject *config);
void sendUpdated();
void sendError(int type, String path, String description);
void configFn(WcFnRequestHandler *handler, String requestUri, HTTPMethod method) {
  switch (method) {
    case HTTP_GET: {
      aJsonObject *root;
      root = aJson.createObject();
      addConfigJson(root);
      sendJson(root);
      break;
    }
    case HTTP_PUT: {
      Serial.print("configFn:");
      Serial.println(HTTP->arg("plain"));
      aJsonObject* body = aJson.parse(( char*) HTTP->arg("plain").c_str());
      sendJson(generateTargetPutResponse(body, "/config/"));
      aJson.deleteItem(body);
      // TODO: actually store this
      break;
    }
    default:
      sendError(4, requestUri, "Config method not supported");
      break;
  }
}

void sendSuccess(String name, String value);
void authFn(WcFnRequestHandler *handler, String requestUri, HTTPMethod method) {
  // On the real bridge, the link button on the bridge must have been recently pressed for the command to execute successfully.
  // We try to execute successfully regardless of a button for now.
  sendSuccess("username", "api");
}

aJsonObject *getGroupJson();
aJsonObject *getSceneJson();
void addLightsJson(aJsonObject *config);
void wholeConfigFn(WcFnRequestHandler *handler, String requestUri, HTTPMethod method) {
  // Serial.println("Respond with complete json as in https://github.com/probonopd/ESP8266HueEmulator/wiki/Hue-API#get-all-information-about-the-bridge");
  aJsonObject *root;
  root = aJson.createObject();
  // the default group 0 is never listed
  aJsonObject *lights;
  aJson.addItemToObject(root, "lights", lights = aJson.createObject());
  addLightsJson(lights);
  aJson.addItemToObject(root, "groups", getGroupJson());
  aJsonObject *config;
  aJson.addItemToObject(root, "config", config = aJson.createObject());
  addConfigJson(config);
  aJsonObject *schedules;
  aJson.addItemToObject(root, "schedules", schedules = aJson.createObject());
  aJsonObject *scenes;
  aJson.addItemToObject(root, "scenes", scenes = getSceneJson());
  aJsonObject *rules;
  aJson.addItemToObject(root, "rules", rules = aJson.createObject());
  aJsonObject *sensors;
  aJson.addItemToObject(root, "sensors", sensors = aJson.createObject());
  aJsonObject *resourceLinks;
  aJson.addItemToObject(root, "resourcelinks", resourceLinks = aJson.createObject());
  sendJson(root);
}

void sceneListingHandler();
String sceneCreationHandler(String id);
String scenePutHandler(String body);
void scenesFn(WcFnRequestHandler *handler, String requestUri, HTTPMethod method) {
  String id = "";
  switch (method) {
    case HTTP_GET:
      sceneListingHandler();
      break;
    //case HTTP_PUT:
    //  id = scenePutHandler("");
    //  break;
    case HTTP_POST:
      sceneCreationHandler("");
      break;
    default:
      sendError(4, requestUri, "Scene method not supported");
      break;
  }
}

LightGroup *findScene(String id);
bool updateScene(String id, String body);
void sendSuccess(String text);
String sceneCreationHandler(String id);
void scenesIdFn(WcFnRequestHandler *handler, String requestUri, HTTPMethod method) {
    int idx1=1;
  if(handler->getWildCard(1) =="") // handle missing key
  {
    idx1=0;
  }
  String sceneId = handler->getWildCard(idx1);
  LightGroup *scene = findScene(sceneId);
  switch (method) {
    case HTTP_GET:
      if (scene) {
        sendJson(scene->getSceneJson(true));
      } else {
        sendError(3, "/scenes/"+sceneId, "Cannot retrieve scene that does not exist");
      }
      break;
    case HTTP_PUT:
      // validate body, delete old group, create new group
      sceneCreationHandler(sceneId);
      // XXX not a valid response according to API
      sendUpdated();
      break;
    case HTTP_DELETE:
      if (scene) {
        updateScene(sceneId, "");
      } else {
        sendError(3, requestUri, "Cannot delete scene that does not exist");
      }
      sendSuccess(requestUri+" deleted");
      break;
    default:
      sendError(4, requestUri, "Scene method not supported");
      break;
  }
  delete(scene);
}

void scenesIdLightFn(WcFnRequestHandler *handler, String requestUri, HTTPMethod method) {
  int idx1=1, idx2=2;
  if(handler->getWildCard(2) =="") // handle missing key
  {
    idx1=0;idx2=1;
  }
  switch (method) {
    case HTTP_PUT: {
      Serial.print("Body: ");
      Serial.println(HTTP->arg("plain"));
      // XXX Do something with this information...
      aJsonObject* body = aJson.parse(( char*) HTTP->arg("plain").c_str());
      sendJson(generateTargetPutResponse(body, "/scenes/" + handler->getWildCard(idx1) + "/lightstates/" + handler->getWildCard(idx2) + "/"));
      aJson.deleteItem(body);
      break;
    }
    default:
      sendError(4, requestUri, "Scene method not supported");
      break;
  }
}

void groupListingHandler();
void groupCreationHandler();
void groupsFn(WcFnRequestHandler *handler, String requestUri, HTTPMethod method) {
  switch (method) {
    case HTTP_GET:
      groupListingHandler();
      break;
    case HTTP_POST:
      groupCreationHandler();
      break;
    default:
      sendError(4, requestUri, "Group method not supported");
      break;
  }
}

//LightGroup *lightGroups[16] = {nullptr, };
LightGroup *loadLightGroup(String fileName);
void groupCreationHandler(String sceneId);
bool updateGroup(String id, String body);
void groupsIdFn(WcFnRequestHandler *handler, String requestUri, HTTPMethod method) {

