Quanghoster/ESP8266HueEmulator/ESP8266HueEmulator/LightService.cpp
  int idx1=1;
  if(handler->getWildCard(1) =="") // handle missing key
  {
    idx1=0;
  }
  
  String groupNumText = handler->getWildCard(idx1);
  int groupNum = atoi(groupNumText.c_str());
  String fileName = GROUP_FILE_TEMPLATE;
  fileName.replace("%d",groupNumText);
  if ((groupNum == -1 && groupNumText != "0") || groupNum > 16 || (groupNum >= 0 && !SPIFFS.exists(fileName))) {
    // error, invalid group number
    sendError(3, requestUri, "Invalid group number");
    return;
  }

  switch (method) {
    case HTTP_GET:
      if (groupNum != -1) {
        LightGroup *lightGroup = loadLightGroup(fileName);
        sendJson(lightGroup->getJson());
        delete(lightGroup);
      } else {
        aJsonObject *object = aJson.createObject();
        aJson.addStringToObject(object, "name", "0");
        aJsonObject *lightsArray = aJson.createArray();
        aJson.addItemToObject(object, "lights", lightsArray);
        for (int i = 0; i < LightService.getLightsAvailable(); i++) {
          if (!lightHandlers[i]) {
            continue;
          }
          // add light to list
          String lightNum = "";
          lightNum += (i + 1);
          aJson.addItemToArray(lightsArray, aJson.createItem(lightNum.c_str()));
        }
        sendJson(object);
      }
      break;
    case HTTP_PUT:
      // validate body, delete old group, create new group
      updateGroup(groupNumText, HTTP->arg("plain"));
      sendUpdated();
      break;
    case HTTP_DELETE:
      updateGroup(groupNumText, "");
      sendSuccess(requestUri+" deleted");
      break;
    default:
      sendError(4, requestUri, "Group method not supported");
      break;
  }
}

LightGroup *loadLightGroup(String fileName);
void applyConfigToLightMask(unsigned int lights);
void groupsIdActionFn(WcFnRequestHandler *handler, String requestUri, HTTPMethod method) {
  int idx1=1;
  if(handler->getWildCard(1) =="") // handle missing key
  {
    idx1=0;
  }
  if (method != HTTP_PUT) {
    // error, only PUT allowed
    sendError(4, requestUri, "Only PUT supported for groups/*/action");
    return;
  }

  String groupNumText = handler->getWildCard(idx1);
  int groupNum = atoi(groupNumText.c_str());
  String fileName = GROUP_FILE_TEMPLATE;
  fileName.replace("%d",groupNumText);
  if ((groupNum == -1 && groupNumText != "0") || groupNum >= 16 || (groupNum >= 0 && !SPIFFS.exists(fileName))) {
    // error, invalid group number
    sendError(3, requestUri, "Invalid group number");
    return;
  }
  LightGroup *lightGroup = loadLightGroup(fileName);
  
  // parse input as if for all lights
  unsigned int lightMask;
  if (groupNum == -1) {
    lightMask == 0xFFFF;
  } else {    
    lightMask = lightGroup->getLightMask();
  }
  // apply to group
  applyConfigToLightMask(lightMask);
}

void lightsFn(WcFnRequestHandler *handler, String requestUri, HTTPMethod method) {
  switch (method) {
    case HTTP_GET: {
      // dump existing lights
      aJsonObject *lights = aJson.createObject();
      addLightsJson(lights);
      sendJson(lights);
      break;
    }
    case HTTP_POST:
      // "start" a "search" for "new" lights
      sendSuccess("/lights", "Searching for new devices");
      break;
    default:
      sendError(4, requestUri, "Light method not supported");
      break;
  }
}

void addSingleLightJson(aJsonObject* , int , LightHandler *);
void lightsIdFn(WcFnRequestHandler *whandler, String requestUri, HTTPMethod method) {
    int idx1=1;
  if(whandler->getWildCard(1) =="") // handle missing key
  {
    idx1=0;
  }
  int numberOfTheLight = atoi(whandler->getWildCard(idx1).c_str()) - 1;
  LightHandler *handler = LightService.getLightHandler(numberOfTheLight);
  switch (method) {
    case HTTP_GET: {
      aJsonObject *root;
      root = aJson.createObject();
      addSingleLightJson(root, numberOfTheLight, handler);
      sendJson(root);
      break;
    }
    case HTTP_PUT:
      // XXX do something here
      sendUpdated();
      break;
    default:
      sendError(4, requestUri, "Light method not supported");
      break;
  }
}

void lightsIdStateFn(WcFnRequestHandler *whandler, String requestUri, HTTPMethod method) {
    int idx1=1;
  if(whandler->getWildCard(1) =="") // handle missing key
  {
    idx1=0;
  }
  int numberOfTheLight = max(0, atoi(whandler->getWildCard(idx1).c_str()) - 1);
  LightHandler *handler = LightService.getLightHandler(numberOfTheLight);
  if (!handler) {
    char buff[100] = {};
    sprintf(buff, "Requested light not available for number %d", numberOfTheLight);
    sendError(3, requestUri, buff);
    return;
  }

  switch (method) {
    case HTTP_POST:
    case HTTP_PUT: { 
      aJsonObject* parsedRoot = aJson.parse( (char*) HTTP->arg("plain").c_str());   
      if (!parsedRoot) {
        // unparseable json
          sendError(2, requestUri, "Bad JSON body in request");
          return;       
      }
      HueLightInfo currentInfo = handler->getInfo(numberOfTheLight);
      HueLightInfo newInfo;
      if (!parseHueLightInfo(currentInfo, parsedRoot, &newInfo)) {
        aJson.deleteItem(parsedRoot);
        return;
      }
      
      handler->handleQuery(numberOfTheLight, newInfo, parsedRoot);
      sendJson(generateTargetPutResponse(parsedRoot, "/lights/" + whandler->getWildCard(idx1) + "/state/"));
      aJson.deleteItem(parsedRoot);
      break;
    }
    default:
      sendError(4, requestUri, "Light method not supported");
      break;
  }
}

void lightsNewFn(WcFnRequestHandler *handler, String requestUri, HTTPMethod method) {
  // dump empty object
  aJsonObject *lights = aJson.createObject();
  sendJson(lights);
}

void LightServiceClass::begin() {
  begin(new ESP8266WebServer(80));
}

void LightServiceClass::begin(ESP8266WebServer *svr) {
  HTTP = svr;
  macString = WiFi.macAddress();
  bridgeIDString = macString;
  bridgeIDString.replace(":", "");
  bridgeIDString = bridgeIDString.substring(0, 6) + "FFFE" + bridgeIDString.substring(6);
  ipString = StringIPaddress(WiFi.localIP());
  netmaskString = StringIPaddress(WiFi.subnetMask());
  gatewayString = StringIPaddress(WiFi.gatewayIP());

  Serial.print("Starting HTTP at ");
  Serial.print(WiFi.localIP());
  Serial.print(":");
  Serial.println(80);

