Quanghoster/ESP8266HueEmulator/ESP8266HueEmulator/LightService.cpp
  if (info.bulbType == HueBulbType::EXTENDED_COLOR_LIGHT) {
    double numbers[2] = {0.0, 0.0};
    aJson.addItemToObject(state, "xy", aJson.createFloatArray(numbers, 2)); // xy mode: CIE 1931 color co-ordinates
    aJson.addStringToObject(state, "colormode", "hs"); // the current color mode
    aJson.addStringToObject(state, "effect", info.effect == EFFECT_COLORLOOP ? "colorloop" : "none");
    aJson.addNumberToObject(state, "ct", 500); // ct mode: color temp (expressed in mireds range 154-500)

    aJson.addNumberToObject(state, "hue", info.hue); // hs mode: the hue (expressed in ~deg*182.04)
    aJson.addNumberToObject(state, "sat", info.saturation); // hs mode: saturation between 0-254
  }
  
  aJson.addStringToObject(state, "alert", "none"); // 'select' flash the lamp once, 'lselect' repeat flash for 30s
  aJson.addBooleanToObject(state, "reachable", true); // lamp can be seen by the hub
}

void addLightsJson(aJsonObject *lights) {
  for (int i = 0; i < LightService.getLightsAvailable(); i++) {
    addLightJson(lights, i, LightService.getLightHandler(i));
  }
}

static String format2Digits(int num) {
  String s = "";

  if (num < 10) {
    s += "0";
  }
  s += String(num);
  return s;
}

void addConfigJson(aJsonObject *root)
{
  aJson.addStringToObject(root, "name", "hue emulator");
  aJson.addStringToObject(root, "swversion", "81012917");
  aJson.addStringToObject(root, "bridgeid", bridgeIDString.c_str());
  aJson.addBooleanToObject(root, "portalservices", false);
  aJson.addBooleanToObject(root, "linkbutton", true);
  aJson.addStringToObject(root, "mac", macString.c_str());
  aJson.addBooleanToObject(root, "dhcp", true);
  aJson.addStringToObject(root, "ipaddress", ipString.c_str());
  aJson.addStringToObject(root, "netmask", netmaskString.c_str());
  aJson.addStringToObject(root, "gateway", gatewayString.c_str());
  aJson.addStringToObject(root, "apiversion", "1.3.0");
  if (timeStatus() == timeSet) {
    time_t moment = now();
    String dts = String(year(moment));
    dts += "-";
    dts += format2Digits(month(moment));
    dts += "-";
    dts += format2Digits(day(moment));
    dts += "T";
    dts += NTP.getTimeStr(moment);

    // TODO: send this as "utc" and "localtime" as timezone corrected utc
    aJson.addStringToObject(root, "localtime", dts.c_str());
  }
  // TODO: take this from the settings, once we have spiffs support
  aJson.addStringToObject(root, "timezone", "Europe/London");
  aJsonObject *whitelist;
  aJson.addItemToObject(root, "whitelist", whitelist = aJson.createObject());
  aJsonObject *whitelistFirstEntry;
  aJson.addItemToObject(whitelist, "api", whitelistFirstEntry = aJson.createObject());
  aJson.addStringToObject(whitelistFirstEntry, "name", "clientname#devicename");
  aJsonObject *swupdate;
  aJson.addItemToObject(root, "swupdate", swupdate = aJson.createObject());
  aJson.addStringToObject(swupdate, "text", "");
  aJson.addBooleanToObject(swupdate, "notify", false); // Otherwise client app shows update notice
  aJson.addNumberToObject(swupdate, "updatestate", 0);
  aJson.addStringToObject(swupdate, "url", "");
}

String trimSlash(String uri) {
  if (uri.startsWith("/")) {
    uri.remove(0, 1);
  }
  return uri;
}

aJsonObject *validateGroupCreateBody(String body) {
  aJsonObject *root = aJson.parse(( char*) body.c_str());
  aJsonObject* jName = aJson.getObjectItem(root, "name");
  aJsonObject* jLights = aJson.getObjectItem(root, "lights");
  if (!jName || !jLights) {
    return nullptr;
  }
  return root;
}

void applyConfigToLightMask(unsigned int lights) {
  Serial.print("applyConfigToLightMask:");
  Serial.println(HTTP->arg("plain"));
  aJsonObject* parsedRoot = aJson.parse(( char*) HTTP->arg("plain").c_str());
  if (parsedRoot) {
    for (int i = 0; i < LightService.getLightsAvailable(); i++) {
      LightHandler *handler = LightService.getLightHandler(i);
      HueLightInfo currentInfo = handler->getInfo(i);
      HueLightInfo newInfo;
      if (parseHueLightInfo(currentInfo, parsedRoot, &newInfo)) {
        handler->handleQuery(i, newInfo, parsedRoot);
      }
    }
    aJson.deleteItem(parsedRoot);

    // As per the spec, the response can be "Updated." for memory-constrained devices
    sendUpdated();
  } else if (HTTP->arg("plain") != "") {
    // unparseable json
    sendError(2, "groups/0/action", "Bad JSON body in request");
  }
}
// check the file system and restore group slots from them

// returns true on failure
bool updateGroup(String id, String body) {
  String fileName = GROUP_FILE_TEMPLATE;
  fileName.replace("%d",id);
  
  aJsonObject *root;
  if (body != "") {
    Serial.print("updateGroupSlot:");
    Serial.println(body);
    root = validateGroupCreateBody(body);
  }
  if (!root && body != "") {
    // throw error bad body
    sendError(2, "groups/" + id, "Bad JSON body");
    return true;
  }
    if (SPIFFS.exists(fileName))
      SPIFFS.remove(fileName);
  
  if (body != "") {
    Serial.print("Updating ");Serial.println(fileName);
    LightGroup *lightGroup = new LightGroup(root);
    File f = SPIFFS.open(fileName,"w");
    char* json = aJson.print(lightGroup->getJson());
    f.print(json);
    f.flush();
    f.close();
    free(json);
    aJson.deleteItem(root);
    delete(lightGroup);
  }
  return false;
}

void groupCreationHandler() {
  // handle group creation
  // find first available group slot
  int availableSlot = -1;
  for (int i = 1; i <= MAX_GROUPS; i++) {  // TEST start at 1 instead of 0
    String fileName = GROUP_FILE_TEMPLATE;
    fileName.replace("%d",String(i));
    if (!SPIFFS.exists(fileName)) {   
      availableSlot = i;
      break;
    }
  }
  if (availableSlot == -1) {
    // throw error no new groups allowed
    sendError(301, "groups", "Groups table full");
    return;
  }
  if (!updateGroup(String(availableSlot), HTTP->arg("plain"))) {
    String slot = "";
    slot += availableSlot;
    sendSuccess("id", slot);
  }
}

LightGroup *loadLightGroup(String filename); 
aJsonObject *getGroupJson() {
  // iterate over groups and serialize
  aJsonObject *root = aJson.createObject();
  for (int i = 1; i <= MAX_GROUPS; i++) {
    String fileName = GROUP_FILE_TEMPLATE;
    fileName.replace("%d",String(i,DEC));
    if (SPIFFS.exists(fileName)) {
      String sIndex = "";
      sIndex += i;
      Serial.print("Loading ");Serial.println(fileName);
      LightGroup *lightGroup = loadLightGroup(fileName);     
      if(lightGroup != nullptr){
        aJson.addItemToObject(root, sIndex.c_str(), lightGroup->getJson());
        delete(lightGroup);
      }
       else
        Serial.println("error creating lightGroup in getGroupJson()");
    }
  }
  return root;
}

void groupListingHandler() {
  sendJson(getGroupJson());
}

