Quanghoster/ESP8266HueEmulator/ESP8266HueEmulator/LightService.cpp
bool updateScene(String id, String body) {
  aJsonObject *root;
  if (body != "") {
    Serial.print("updateScene:");
    Serial.println(body);
    root = validateGroupCreateBody(body);
  }
  if (!root && body != "") {
    // throw error bad body
    sendError(2, "scenes/" + id, "Bad JSON body");
    return true;
  }
  String fileName = SCENE_FILE_TEMPLATE;
  fileName.replace("%d",id);

  if(SPIFFS.exists(fileName)){
    SPIFFS.remove(fileName);   
  }
  if (body != "") {
    LightGroup *lightScene = new LightGroup(root);
    lightScene->id = id;
    aJson.deleteItem(root);
    Serial.print("Updating Scene ");Serial.print(lightScene->id);Serial.println(fileName);
    File f = SPIFFS.open(fileName,"w");
    char* json = aJson.print(lightScene->getSceneJson(true));
    delete(lightScene);
    f.print(json);
    f.flush();
    f.close();
    free(json);
    
  }
  return false;
}

LightGroup *loadLightGroup(String id);
String scenePutHandler(String id) {
  Serial.print("scenePutHandler( ");Serial.print(id);Serial.println(")");

  // updateSceneSlot sends failure messages
  LightGroup *lightScene = nullptr;
  if (!updateScene(id, HTTP->arg("plain"))) {
    
    aJsonObject *root= aJson.createArray();
    aJsonObject *response1 = aJson.createArray();
    aJsonObject *response2 = aJson.createArray();
    aJsonObject *lights = aJson.createArray();
          for (int i = 0; i < 16; i++) {
        if (!((1 << i) & lightScene->getLightMask())) {
          continue;
        }
        // add light to list
        String lightNum = "";
        lightNum += (i + 1);
        aJson.addItemToArray(lights, aJson.createItem(lightNum.c_str()));
      }
    aJsonObject *addr1 = aJson.createObject();
    aJsonObject *addr2 = aJson.createObject();
    aJsonObject *success1 = aJson.createObject();
    aJsonObject *success2 = aJson.createObject();
    String a1 = "/scenes/";a1 += lightScene->id.c_str();a1 += "/name";
    aJson.addStringToObject(addr1, "address", a1.c_str());
    aJson.addStringToObject(addr1, "value", lightScene->getName().c_str());
    String a2 = "/scenes/";a2 += lightScene->id.c_str();a2 += "/lights";
    aJson.addStringToObject(addr2, "address", a2.c_str());
    aJson.addItemToObject(addr2, "value", lights);   
     
    aJson.addItemToObject(success1, "success", addr1);
    aJson.addItemToObject(success2, "success", addr2);

    aJson.addItemToArray(root, success1);
    aJson.addItemToArray(root, success2);
    sendJson(root);
    String newId = lightScene->id;   
    delete(lightScene);
    return newId;
  }
}
/*
 * {"mJD0QNfOV6T-2J7":{
 *      "name":"Savanna sunset",
 *      "lights":["4"],
 *      "owner":"sbs7FAfNhaBqdzKFNTJGhc-DBrQB0rTwi6cYSJsY",
 *      "recycle":false,
 *      "locked":false,
 *      "appdata":{
 *          "version":1,
 *          "data":"kbixx_r01_d15"
 *          },
 *          "picture":"",
 *          "lastupdated":"2017-11-04T10:17:15",
 *          "version":2
 * }
 *  
 *  {"1":{
 *  "name":"SCENE1",
 *  "lights":["2"],
 *  "owner":"api",
 *  "recycle":false,
 *  "locked":false,
 *  "appdata":{
 *        "version":1,
 *        "data":""
 *        },
 *        "picture":"",
 *        "lastupdated":"2017-11-04T10:17:15",
 *        "version":2
 * }
 * }

 */


String sceneCreationHandler(String id) {
  
  String newId = "";
  Serial.print("sceneCreationHandler()");Serial.println(id);
  if(id != "")
  {
    newId = id;
  }
  else
  {
    int availableSlot = -1;
    for (int i = 1; i <= MAX_SCENES; i++) {  // TEST start at 1 instead of 0
      String fileName = SCENE_FILE_TEMPLATE;
      fileName.replace("%d",String(i));
      if (!SPIFFS.exists(fileName)) {   
        availableSlot = i;
        break;
      }
    }
    if (availableSlot == -1) {
      // throw error no new groups allowed
      sendError(301, "scenes", "Scene table full");
      return "";
    }
    newId = String(availableSlot);
  }  
  
  // updateSceneSlot sends failure messages
  if (!updateScene(newId, HTTP->arg("plain"))) {
    sendSuccess("id", newId);
    return newId;
  }
}

LightGroup *loadLightGroup(String filename); 
aJsonObject *getSceneJson() {
  // iterate over groups and serialize
  aJsonObject *root = aJson.createObject();
  for (int i = 1; i <= MAX_SCENES; i++) {
    String fileName = SCENE_FILE_TEMPLATE;
    fileName.replace("%d",String(i,DEC));
    if (SPIFFS.exists(fileName)) {
      String sIndex = "";
      sIndex += i;
      Serial.print("Loading ");Serial.println(fileName);
      LightGroup *lightScene = loadLightGroup(fileName);     
      if(lightScene != nullptr){
        aJson.addItemToObject(root, sIndex.c_str(), lightScene->getSceneJson(false));
        delete(lightScene);
      }
       else
        Serial.println("error creating lightScene in getSceneJson()");
    }
  }
  return root;
}

void sceneListingHandler() {
  sendJson(getSceneJson());
}

// load a lightGroup json structure from a file
LightGroup *loadLightGroup(String fileName)
{
  LightGroup *lightGroup = nullptr;
  File f  = SPIFFS.open(fileName,"r");
  if(f)
  {
    size_t fsize = f.size();
    if(fsize > 0)
    {
      std::shared_ptr<char> buf(new char[fsize], std::default_delete<char[]>());
     //std::unique_ptr<char[]> buf (new char[fsize]);
      Serial.print("Reading in to buffer - size="); Serial.println(String(fsize));
      f.readBytes(buf.get(), fsize);            
      lightGroup = new LightGroup(aJson.parse(buf.get()));
      f.close();
    }
  } 
  return lightGroup;       
}
/*
Check the filesystem for a scene
If found, load it into a LightGroup and return it
*/
LightGroup *findScene(String id) {
  LightGroup *lightScene = nullptr;
  Dir dir = SPIFFS.openDir("/");
  while (dir.next()) {    
    if(dir.fileName().startsWith("/SCENE-") &&  dir.fileName().endsWith("-"+id))
    {
     Serial.print("Found "); Serial.println(dir.fileName());
     lightScene = loadLightGroup(dir.fileName());
    }
  }
  return lightScene;
}

String methodToString(int method) {
  switch (method) {
    case HTTP_POST: return "POST";
    case HTTP_GET: return "GET";
    case HTTP_PUT: return "PUT";
    case HTTP_PATCH: return "PATCH";
    case HTTP_DELETE: return "DELETE";
    case HTTP_OPTIONS: return "OPTIONS";
    default: return "unknown";
  }
}

